<script lang="ts">
    const cableLines = [
        {
            code: 'Л1',
            name: 'Гирлянда',
            room: 'Спальня',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л1-1',
                    name: 'Гирлянда'
                },
                {
                    code: 'Л1-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л2',
            name: 'Розетки',
            room: 'Спальня',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л2-1',
                    name: 'Розетка подоконника'
                },
                {
                    code: 'Л2-2',
                    name: 'Розетки под туалетным столиком'
                },
                {
                    code: 'Л2-3',
                    name: 'Розетки под туалетным столиком'
                },
                {
                    code: 'Л2-4',
                    name: 'Розетки справа от кровати'
                },
                {
                    code: 'Л2-5',
                    name: 'Розетки справа от кровати'
                },
                {
                    code: 'Л2-6',
                    name: 'Розетки под кроватью'
                },
                {
                    code: 'Л2-7',
                    name: 'Розетки под кроватью'
                },
                {
                    code: 'Л2-8',
                    name: 'Розетки слева от кровати'
                },
                {
                    code: 'Л2-9',
                    name: 'Розетки слева от кровати'
                },
                {
                    code: 'Л2-10',
                    name: 'Розетки слева от зеркала'
                },
                {
                    code: 'Л2-11',
                    name: 'Розетки слева от зеркала'
                },
                {
                    code: 'Л2-12',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л3',
            name: 'Кондиционер',
            room: 'Спальня',
            cable: 'КВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л3-1',
                    name: 'Кондиционер'
                },
                {
                    code: 'Л3-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л4',
            name: 'Подсветка зеркала',
            room: 'Спальня',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л4-1',
                    name: 'Зеркало'
                },
                {
                    code: 'Л4-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л5',
            name: 'Люстра',
            room: 'Спальня',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л5-1',
                    name: 'Люстар'
                },
                {
                    code: 'Л5-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л6',
            name: 'Электрокарниз (силовая линия)',
            room: 'Спальня',
            cable: 'КВВГнг-LS 4х1.5',
            points: [
                {
                    code: 'Л6-1',
                    name: 'Электрокарниз'
                },
                {
                    code: 'Л6-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л7',
            name: 'Электрокарниз (слаботочная линия)',
            room: 'Спальня',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л7-1',
                    name: 'Электрокарниз'
                },
                {
                    code: 'Л7-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л8',
            name: 'Выключатель справа от кровати',
            room: 'Спальня',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л8-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л8-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л9',
            name: 'Выключатель слева от кровати',
            room: 'Спальня',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л9-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л9-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л10',
            name: 'Потолочный светильник над унитазом',
            room: 'Санузел взрослый',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л10-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л10-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л11',
            name: 'Потолочный светильник у полотенцесушителя',
            room: 'Санузел взрослый',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л11-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л11',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л12',
            name: 'Потолочный светильник у раковины',
            room: 'Санузел взрослый',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л12-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л12-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л13',
            name: 'Потолочный светильник над душем',
            room: 'Санузел взрослый',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л13-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л13-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л14',
            name: 'Полотенцесушитель',
            room: 'Санузел взрослый',
            cable: 'КВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л14-1',
                    name: 'Полотенцесушитель'
                },
                {
                    code: 'Л14-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л15',
            name: 'Розетки пенала',
            room: 'Санузел взрослый',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л15-1',
                    name: 'Пенал'
                },
                {
                    code: 'Л15-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л16',
            name: 'Свет',
            room: 'Сауна',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л16-1',
                    name: 'Щит сауны'
                },
                {
                    code: 'Л16-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л17',
            name: 'Электрокаменка',
            room: 'Сауна',
            cable: 'ВВГнг-LS 5х2.5',
            points: [
                {
                    code: 'Л17-1',
                    name: 'Щит сауны'
                },
                {
                    code: 'Л17-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л18',
            name: 'Розетки',
            room: 'Кабинет',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л18-1',
                    name: 'Розетки подоконника'
                },
                {
                    code: 'Л18-2',
                    name: 'Розетки под столом'
                },
                {
                    code: 'Л18-3',
                    name: 'Розетки под столом'
                },
                {
                    code: 'Л18-4',
                    name: 'Розетка у двери'
                },
                {
                    code: 'Л18-5',
                    name: 'Розетки у двери'
                },
                {
                    code: 'Л18-6',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л19',
            name: 'Кондиционер',
            room: 'Кабинет',
            cable: 'КВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л19-1',
                    name: 'Кондиционер'
                },
                {
                    code: 'Л19-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л20',
            name: 'Розетки',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л20-1',
                    name: 'Коридор взрослый'
                },
                {
                    code: 'Л20-2',
                    name: 'Розетки у двери в коридор взрослый'
                },
                {
                    code: 'Л20-3',
                    name: 'Розетки у двери в коридор взрослый'
                },
                {
                    code: 'Л20-4',
                    name: 'Розетки в тумбе телевизора'
                },
                {
                    code: 'Л20-5',
                    name: 'Розетки в тумбе телевизора'
                },
                {
                    code: 'Л20-6',
                    name: 'Розетки подоконника левого окна'
                },
                {
                    code: 'Л20-7',
                    name: 'Розетки подоконника левого окна'
                },
                {
                    code: 'Л20-8',
                    name: 'Розетки внизу между окнами'
                },
                {
                    code: 'Л20-9',
                    name: 'Розетки внизу между окнами'
                },
                {
                    code: 'Л20-10',
                    name: 'Розетки подоконника правого окна'
                },
                {
                    code: 'Л20-11',
                    name: 'Розетки подоконника правого окна'
                },
                {
                    code: 'Л20-12',
                    name: 'Розетки между шторами и диваном'
                },
                {
                    code: 'Л20-13',
                    name: 'Розетки между шторами и диваном'
                },
                {
                    code: 'Л20-14',
                    name: 'Розетки у двери коридора котельной'
                },
                {
                    code: 'Л20-15',
                    name: 'Розетки у двери коридора котельной'
                },
                {
                    code: 'Л20-16',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л21',
            name: 'Утюг (силовая линия)',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л21',
                    name: 'Утюг'
                },
                {
                    code: 'Л22',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л22',
            name: 'Гирлянда правого окна',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л22-1',
                    name: 'Гирлянда'
                },
                {
                    code: 'Л22-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л23',
            name: 'Гирлянда левго окна',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л23-1',
                    name: 'Гирлянда'
                },
                {
                    code: 'Л23-1',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л24',
            name: 'Электрокарниз (силовая линия)',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 4х1.5',
            points: [
                {
                    code: 'Л24-1',
                    name: 'Электрокарниз'
                },
                {
                    code: 'Л24-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л25',
            name: 'Электрокарниз (слаботочная линия)',
            room: 'Кухня-гостинная',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л25-1',
                    name: 'Электрокарниз'
                },
                {
                    code: 'Л25-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л26',
            name: 'Светильник над обеденным столом',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л26-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л26-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л27',
            name: 'Розетки справа от раковины',
            room: 'Санузел взрослый',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л27-1',
                    name: 'Розетки'
                },
                {
                    code: 'Л27-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л28',
            name: 'Розетки',
            room: 'Санузел взрослый',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л28-1',
                    name: 'Коридор взрослый'
                },
                {
                    code: 'Л28-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л29',
            name: 'Подсветка фартука',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л29-1',
                    name: 'Шкаф на варочной панелью'
                },
                {
                    code: 'Л29-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л30',
            name: 'Низковольтная линия',
            room: 'Коридор взрослый',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л30-1',
                    name: 'Коридор взрослый'
                },
                {
                    code: 'Л30-2',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л31',
            name: 'Свет',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л31-1',
                    name: 'Коридор взрослый'
                },
                {
                    code: 'Л31-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л32',
            name: 'Свет',
            room: 'Спальня',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л32-1',
                    name: 'Коридор взрослый'
                },
                {
                    code: 'Л32-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л33',
            name: 'Свет',
            room: 'Кабинет',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л33-1',
                    name: 'Коридор взрослый'
                },
                {
                    code: 'Л33-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л34',
            name: 'Свет',
            room: 'Санузел взрослый',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л34-1',
                    name: 'Коридор взрослый'
                },
                {
                    code: 'Л34-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л35',
            name: 'Духовой шкаф',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л35-1',
                    name: 'Духовой шкаф'
                },
                {
                    code: 'Л35-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л36',
            name: 'СВЧ',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л36-1',
                    name: 'СВЧ'
                },
                {
                    code: 'Л36-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л37',
            name: 'Розетки фартук',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л37-1',
                    name: 'Розетки рядом с колонной СВЧ'
                },
                {
                    code: 'Л37-2',
                    name: 'Розетки слева от варочной панели'
                },
                {
                    code: 'Л37-3',
                    name: 'Розетки слева от варочной панели'
                },
                {
                    code: 'Л37-4',
                    name: 'Розетки под мойкой в углу'
                },
                {
                    code: 'Л37-5',
                    name: 'Розетки под мойкой в углу'
                },
                {
                    code: 'Л37-6',
                    name: 'Розетки над ПММ'
                },
                {
                    code: 'Л37-7',
                    name: 'Розетки над ПММ'
                },
                {
                    code: 'Л37-8',
                    name: 'Силовой щит'
                },
            ]
        },
        {
            code: 'Л38',
            name: 'Розетки чайник',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л38-1',
                    name: 'Розетки'
                },
                {
                    code: 'Л38-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л39',
            name: 'Розетки кофемашины',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л39-1',
                    name: 'Розетки'
                },
                {
                    code: 'Л39-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л40',
            name: 'Варочная панель',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 4х4',
            points: [
                {
                    code: 'Л40-1',
                    name: 'Варочная панель'
                },
                {
                    code: 'Л40-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л41',
            name: 'Розетки',
            room: 'Комната Марка',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л41-1',
                    name: 'Розетки телевизор'
                },
                {
                    code: 'Л41-2',
                    name: 'Розетки игровая зона'
                },
                {
                    code: 'Л41-3',
                    name: 'Розетки игровая зона'
                },
                {
                    code: 'Л41-4',
                    name: 'Розетки второй этаж кровати'
                },
                {
                    code: 'Л41-5',
                    name: 'Розетки второй этаж кровати'
                },
                {
                    code: 'Л41-6',
                    name: 'Розетки между за шторами внизу'
                },
                {
                    code: 'Л41-7',
                    name: 'Розетки между за шторами внизу'
                },
                {
                    code: 'Л41-8',
                    name: 'Розетки подоконник'
                },
                {
                    code: 'Л41-9',
                    name: 'Розетки подоконник'
                },
                {
                    code: 'Л41-10',
                    name: 'Розетки над столом'
                },
                {
                    code: 'Л41-11',
                    name: 'Розетки над столом'
                },
                {
                    code: 'Л41-12',
                    name: 'Розетки у двери'
                },
                {
                    code: 'Л41-13',
                    name: 'Розетки у двери'
                },
                {
                    code: 'Л41-14',
                    name: 'Силовой щит'
                },
            ]
        },
        {
            code: 'Л42',
            name: 'Светильник второй этаж кровати',
            room: 'Комната Марка',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л42-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л42-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л43',
            name: 'Светильник первый этаж кровати',
            room: 'Комната Марка',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л43-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л43-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л44',
            name: 'Гирлянда',
            room: 'Комната Марка',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л44-1',
                    name: 'Гирлянда'
                },
                {
                    code: 'Л44-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л45',
            name: 'Электрокарниз (силовая линия)',
            room: 'Комната Марка',
            cable: 'КВВГнг-LS 4х1.5',
            points: [
                {
                    code: 'Л45-1',
                    name: 'Электрокарниз'
                },
                {
                    code: 'Л45-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л46',
            name: 'Электрокарниз (слаботочная линия)',
            room: 'Комната Марка',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л46-1',
                    name: 'Электрокарниз'
                },
                {
                    code: 'Л46-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л47',
            name: 'Выключатель над столом',
            room: 'Комната Марка',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л47-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л47-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л48',
            name: 'Кондиционер',
            room: 'Комната Марка',
            cable: 'КВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л48-1',
                    name: 'Кондиционер'
                },
                {
                    code: 'Л48-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л49',
            name: 'Потолочный светильник у окна',
            room: 'Комната Марка',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л49-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л49-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л50',
            name: 'Люстра',
            room: 'Комната Марка',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л50-1',
                    name: 'Люстра'
                },
                {
                    code: 'Л50-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л51',
            name: 'Потолочный светильник над игровой зоной',
            room: 'Комната Марка',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л51-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л51-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л52',
            name: 'Потолочный светильник у двери',
            room: 'Комната Марка',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л52-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л52-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л53',
            name: 'Полотенцесушитель',
            room: 'Санузел детский',
            cable: 'КВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л53-1',
                    name: 'Полотенцесушитель'
                },
                {
                    code: 'Л53-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л54',
            name: 'Выключатель второй этаж кровати',
            room: 'Комната Марка',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л54-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л54-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л55',
            name: 'Выключатель первый этаж кровати',
            room: 'Комната Марка',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л55-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л55-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л56',
            name: 'Потолочный светильник слева от ванны',
            room: 'Санузел детский',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л56-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л56-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л57',
            name: 'Потолочный светильник справа от ванны',
            room: 'Санузел детский',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л57-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л57-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л58',
            name: 'Потолочный светильник над унитазом',
            room: 'Санузел детский',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л58-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л58-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л59',
            name: 'Светильник над раковиной',
            room: 'Санузел детский',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л59-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л59-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л60',
            name: 'Свет',
            room: 'Комната Марка',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л60-1',
                    name: 'Коридор детский'
                },
                {
                    code: 'Л60-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л61',
            name: 'Свет',
            room: 'Санузел детский',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л61-1',
                    name: 'Коридор детский'
                },
                {
                    code: 'Л61-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л62',
            name: 'Розетки',
            room: 'Санузел детский',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л62-1',
                    name: 'Розетки справа от раковины'
                },
                {
                    code: 'Л62-2',
                    name: 'Розетки пенал'
                },
                {
                    code: 'Л62-3',
                    name: 'Розетки пенал'
                },
                {
                    code: 'Л62-4',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л63',
            name: 'Розетки под раковиной в тумбе',
            room: 'Санузел детский',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л63-1',
                    name: 'Розетки'
                },
                {
                    code: 'Л63-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л64',
            name: 'Подсветка зеркала',
            room: 'Санузел детский',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л64-1',
                    name: 'Зеркало'
                },
                {
                    code: 'Л64-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л65',
            name: 'Розетки',
            room: 'Комната Мии',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л65-1',
                    name: 'Розетки телевизор'
                },
                {
                    code: 'Л65-2',
                    name: 'Розетки в углу'
                },
                {
                    code: 'Л65-3',
                    name: 'Розетки в углу'
                },
                {
                    code: 'Л65-4',
                    name: 'Розетки между зеркалом и кроватью'
                },
                {
                    code: 'Л65-5',
                    name: 'Розетки между зеркалом и кроватью'
                },
                {
                    code: 'Л65-6',
                    name: 'Розетки над кроватью'
                },
                {
                    code: 'Л65-7',
                    name: 'Розетки над кроватью'
                },
                {
                    code: 'Л65-8',
                    name: 'Розетки за шторами'
                },
                {
                    code: 'Л65-9',
                    name: 'Розетки за шторами'
                },
                {
                    code: 'Л65-10',
                    name: 'Розетки подоконник'
                },
                {
                    code: 'Л65-11',
                    name: 'Розетки подоконник'
                },
                {
                    code: 'Л65-12',
                    name: 'Розетки у двери'
                },
                {
                    code: 'Л65-13',
                    name: 'Розетки у двери'
                },
                {
                    code: 'Л65-14',
                    name: 'Силовой щит'
                },
            ]
        },
        {
            code: 'Л66',
            name: 'Светильник вывеска',
            room: 'Комната Мии',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л66-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л66-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л67',
            name: 'Подсветка зеркала',
            room: 'Комната Мии',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л67-1',
                    name: 'Зеркало'
                },
                {
                    code: 'Л67-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л68',
            name: 'Светильник над кроватью',
            room: 'Комната Мии',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л68-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л68-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л69',
            name: 'Гирлянда',
            room: 'Комната Мии',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л69-1',
                    name: 'Гирлянда'
                },
                {
                    code: 'Л69-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л70',
            name: 'Электрокарниз (силовая линия)',
            room: 'Комната Мии',
            cable: 'КВВГнг-LS 4х1.5',
            points: [
                {
                    code: 'Л70-1',
                    name: 'Электрокарниз'
                },
                {
                    code: 'Л70-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л71',
            name: 'Электрокарниз (слаботочная линия)',
            room: 'Комната Мии',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л71-1',
                    name: 'Электрокарниз'
                },
                {
                    code: 'Л71-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л72',
            name: 'Выключатель над кроватью',
            room: 'Комната Мии',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л72-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л72-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л73',
            name: 'Выключатель между кроватью и зеркалом',
            room: 'Комната Мии',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л73-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л73-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л74',
            name: 'Кондиционер',
            room: 'Комната Мии',
            cable: 'КВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л74-1',
                    name: 'Кондиционер'
                },
                {
                    code: 'Л74-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л75',
            name: 'Потолочный светильник у окна',
            room: 'Комната Мии',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л75-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л75-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л76',
            name: 'Люстра',
            room: 'Комната Мии',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л76-1',
                    name: 'Люстра'
                },
                {
                    code: 'Л76-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л77',
            name: 'Потолочный светильник у телевизора',
            room: 'Комната Мии',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л77-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л77-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л78',
            name: 'Свет',
            room: 'Комната Мии',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л78-1',
                    name: 'Коридор детский'
                },
                {
                    code: 'Л78-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л79',
            name: 'Низковольтная линия',
            room: 'Коридор детский',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л79-1',
                    name: 'Коридор детский'
                },
                {
                    code: 'Л79-2',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л80',
            name: 'Потолочный светильник',
            room: 'Котельная',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л80-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л80-2',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л81',
            name: 'Сушильный шкаф',
            room: 'Котельная',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л81-1',
                    name: 'Сушильный шкаф'
                },
                {
                    code: 'Л81-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л82',
            name: 'Стиральная машина',
            room: 'Котельная',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л82-1',
                    name: 'Стиральная машина'
                },
                {
                    code: 'Л82-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л83',
            name: 'Сушильная машина',
            room: 'Котельная',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л83-1',
                    name: 'Сушильная машина'
                },
                {
                    code: 'Л83-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л84',
            name: 'Розетки',
            room: 'Санузел детский',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л84-1',
                    name: 'Коридор детский'
                },
                {
                    code: 'Л84-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л85',
            name: 'Подсветка зеркала туалетного столика',
            room: 'Спальня',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л85-1',
                    name: 'Зеркало'
                },
                {
                    code: 'Л85-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л86',
            name: 'Потолочный светильник',
            room: 'Кабинет',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л86-1',
                    name: 'Светильник'
                },
                {
                    code: 'Л86-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л87',
            name: 'Трек у дивана',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 5х1.5',
            points: [
                {
                    code: 'Л87-1',
                    name: 'Трек'
                },
                {
                    code: 'Л87-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л88',
            name: 'Трек у телевизора',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 5х1.5',
            points: [
                {
                    code: 'Л88-1',
                    name: 'Трек'
                },
                {
                    code: 'Л88-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л89',
            name: 'Трек кухня',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 5х1.5',
            points: [
                {
                    code: 'Л89-1',
                    name: 'Трек'
                },
                {
                    code: 'Л89-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л90',
            name: 'Кондиционер',
            room: 'Кухня-гостинная',
            cable: 'КВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л90-1',
                    name: 'Кондиционер'
                },
                {
                    code: 'Л90-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л91',
            name: 'Трек справа от кровати',
            room: 'Спальня',
            cable: 'ВВГнг-LS 5х1.5',
            points: [
                {
                    code: 'Л91-1',
                    name: 'Трек'
                },
                {
                    code: 'Л91-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л92',
            name: 'Трек слева от кровати',
            room: 'Спальня',
            cable: 'ВВГнг-LS 5х1.5',
            points: [
                {
                    code: 'Л92-1',
                    name: 'Трек'
                },
                {
                    code: 'Л92-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л93',
            name: 'Посудомоечная машина',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л93-1',
                    name: 'ПММ'
                },
                {
                    code: 'Л93-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л94',
            name: 'Холодильник',
            room: 'Кухня-гостинная',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л94-1',
                    name: 'Холодильник'
                },
                {
                    code: 'Л94-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л95',
            name: 'Пожарная сигнализация',
            room: 'Коридор котельной',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л95-1',
                    name: 'Сигнализация'
                },
                {
                    code: 'Л95-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л96',
            name: 'Автоматизация и сервер',
            room: 'Коридор котельной',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л96-1',
                    name: 'Коридор котельной'
                },
                {
                    code: 'Л96-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л97',
            name: 'Автоматизация и сервер',
            room: 'Коридор котельной',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л97-1',
                    name: 'Низковольтный щит'
                },
                {
                    code: 'Л97-2',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л98',
            name: 'Щит сауны',
            room: 'Сауна',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л98-1',
                    name: 'Щит сауны'
                },
                {
                    code: 'Л98-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л99',
            name: 'Розетки под раковиной в тумбе',
            room: 'Санузел взрослый',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л99-1',
                    name: 'Розетки'
                },
                {
                    code: 'Л99-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л100',
            name: 'Подсветка зеркала',
            room: 'Санузел взрослый',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л100-1',
                    name: 'Зеркало'
                },
                {
                    code: 'Л100-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л101',
            name: 'Выключатель туалетный столик',
            room: 'Спальня',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л101-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л101-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л102',
            name: 'Розетки прихожей и прачечной',
            room: 'Прихожая',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л102-1',
                    name: 'Розетки у входной двери'
                },
                {
                    code: 'Л102-2',
                    name: 'Розетки межкомнатной двери'
                },
                {
                    code: 'Л102-3',
                    name: 'Розетки межкомнатной двери'
                },
                {
                    code: 'Л102-4',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л103',
            name: 'Розетки прихожей и прачечной',
            room: 'Котельная',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л103-1',
                    name: 'Розетки в шкафу'
                },
                {
                    code: 'Л103-2',
                    name: 'Розетки в слаботочном щиту для робота-пылесоса'
                },
                {
                    code: 'Л103-3',
                    name: 'Розетки в слаботочном щиту для робота-пылесоса'
                },
                {
                    code: 'Л103-4',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л104',
            name: 'Розетки прихожей и прачечной',
            room: 'Коридор котельной',
            cable: 'ВВГнг-LS 3х2.5',
            points: [
                {
                    code: 'Л104-1',
                    name: 'Коридор котельной'
                },
                {
                    code: 'Л104-2',
                    name: 'Силовой щит'
                }
            ]
        },
        {
            code: 'Л105',
            name: 'Электрокарниз (силовая линия)',
            room: 'Кабинет',
            cable: 'ВВГнг-LS 5х1.5',
            points: [
                {
                    code: 'Л105-1',
                    name: 'Электрокарниз'
                },
                {
                    code: 'Л105-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л106',
            name: 'Электрокарниз (слаботочная линия)',
            room: 'Кабинет',
            cable: 'ВВГнг-LS 5х1.5',
            points: [
                {
                    code: 'Л106-1',
                    name: 'Электрокарниз'
                },
                {
                    code: 'Л106-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л107',
            name: 'Интернет TV зона',
            room: 'Кухня-гостинная',
            cable: 'FTP 6',
            points: [
                {
                    code: 'Л107-1',
                    name: 'Тумба'
                },
                {
                    code: 'Л107-2',
                    name: 'Слаботочный щит'
                }
            ]
        },
        {
            code: 'Л108',
            name: 'Интернет TV зона',
            room: 'Кухня-гостинная',
            cable: 'FTP 6',
            points: [
                {
                    code: 'Л108-1',
                    name: 'Тумба'
                },
                {
                    code: 'Л108-2',
                    name: 'Слаботочный щит'
                }
            ]
        },
        {
            code: 'Л109',
            name: 'Интернет TV зона',
            room: 'Кухня-гостинная',
            cable: 'FTP 6',
            points: [
                {
                    code: 'Л109-1',
                    name: 'Тумба'
                },
                {
                    code: 'Л109-2',
                    name: 'Слаботочный щит'
                }
            ]
        },
        {
            code: 'Л110',
            name: 'Интернет TV зона',
            room: 'Кухня-гостинная',
            cable: 'FTP 6',
            points: [
                {
                    code: 'Л110-1',
                    name: 'Тумба'
                },
                {
                    code: 'Л110-2',
                    name: 'Слаботочный щит'
                }
            ]
        },
        {
            code: 'Л111',
            name: 'Интернет',
            room: 'Кабинет',
            cable: 'FTP 6',
            points: [
                {
                    code: 'Л111-1',
                    name: 'Стол'
                },
                {
                    code: 'Л111-2',
                    name: 'Слаботочный щит'
                }
            ]
        },
        {
            code: 'Л112',
            name: 'Интернет',
            room: 'Кабинет',
            cable: 'FTP 6',
            points: [
                {
                    code: 'Л112-1',
                    name: 'Стол'
                },
                {
                    code: 'Л112-2',
                    name: 'Слаботочный щит'
                }
            ]
        },
        {
            code: 'Л113',
            name: 'Интернет',
            room: 'Спальня',
            cable: 'FTP 6',
            points: [
                {
                    code: 'Л113-1',
                    name: 'Точка доступа на дверью'
                },
                {
                    code: 'Л113-2',
                    name: 'Слаботочный щит'
                }
            ]
        },
        {
            code: 'Л114',
            name: 'Автоматизация',
            room: 'Коридор взрослый',
            cable: 'FTP 6',
            points: [
                {
                    code: 'Л114-1',
                    name: 'Коридор взрослый'
                },
                {
                    code: 'Л114-2',
                    name: 'Слаботочный щит'
                }
            ]
        },
        {
            code: 'Л1115',
            name: 'Кондиционер (слаботочная линия)',
            room: 'Спальня',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л1115-1',
                    name: 'Кондиционер'
                },
                {
                    code: 'Л115-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л1116',
            name: 'Выключатель у зеркала',
            room: 'Спальня',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л116-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л116-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л117',
            name: 'Выключатель светильника над обеденный столом',
            room: 'Кухня-гостинная',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л117-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л117-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л118',
            name: 'Выключатель справа от двери взрослого коридора',
            room: 'Кухня-гостинная',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л118-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л118-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л119',
            name: 'Выключатель',
            room: 'Кабинет',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л119-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л119-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л120',
            name: 'Выключаль у унитаза',
            room: 'Санузел взрослый',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л120-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л120-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л121',
            name: 'Выключатель зеркала',
            room: 'Санузел взрослый',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л121-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л121-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л122',
            name: 'Утюг (слаботочная линия)',
            room: 'Кухня-гостинная',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л122-1',
                    name: 'Утюг'
                },
                {
                    code: 'Л122-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л123',
            name: 'Выключатель подсветки кухни',
            room: 'Кухня-гостинная',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л123-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л123-2',
                    name: 'Кухня-гостинная'
                }
            ]
        },
        {
            code: 'Л124',
            name: 'Кухонная вытяжка (слаботочная линия)',
            room: 'Кухня-гостинная',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л124-1',
                    name: 'Шкаф'
                },
                {
                    code: 'Л124-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л125',
            name: 'Свет',
            room: 'Прихожая',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л125-1',
                    name: 'Трек'
                },
                {
                    code: 'Л125-2',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л126',
            name: 'Выключатель у входной двери',
            room: 'Прихожая',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л126-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л126-2',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л127',
            name: 'Выключатели у двери',
            room: 'Комната Марка',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л127-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л127-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л128',
            name: 'Интернет TV-зона',
            room: 'Комната Марка',
            cable: 'FTP 6',
            points: [
                {
                    code: 'Л128-1',
                    name: 'TV-зона'
                },
                {
                    code: 'Л128-2',
                    name: 'Слаботочный щит'
                }
            ]
        },
        {
            code: 'Л129',
            name: 'Интернет стол',
            room: 'Комната Марка',
            cable: 'FTP 6',
            points: [
                {
                    code: 'Л129-1',
                    name: 'Стол'
                },
                {
                    code: 'Л129-2',
                    name: 'Слаботочный щит'
                }
            ]
        },
        {
            code: 'Л130',
            name: 'Интернет TV-зона',
            room: 'Комната Мии',
            cable: 'FTP 6',
            points: [
                {
                    code: 'Л130-1',
                    name: 'TV-зона'
                },
                {
                    code: 'Л130-2',
                    name: 'Слаботочный щит'
                }
            ]
        },
        {
            code: 'Л131',
            name: 'Интернет стол',
            room: 'Комната Мии',
            cable: 'FTP 6',
            points: [
                {
                    code: 'Л131-1',
                    name: 'Стол'
                },
                {
                    code: 'Л131-2',
                    name: 'Слаботочный щит'
                }
            ]
        },
        {
            code: 'Л132',
            name: 'Автоматизация',
            room: 'Коридор детский',
            cable: 'FTP 6',
            points: [
                {
                    code: 'Л132-1',
                    name: 'Коридор детский'
                },
                {
                    code: 'Л132-2',
                    name: 'Слаботочный щит'
                }
            ]
        },
        {
            code: 'Л133',
            name: 'Домофон',
            room: 'Прихожая',
            cable: 'FTP 6',
            points: [
                {
                    code: 'Л133-1',
                    name: 'Домофон'
                },
                {
                    code: 'Л133-2',
                    name: 'Слаботочный щит'
                }
            ]
        },
        {
            code: 'Л134',
            name: 'Автоматизация',
            room: 'Коридор котельной',
            cable: 'FTP 6',
            points: [
                {
                    code: 'Л134-1',
                    name: 'Коридор котельной'
                },
                {
                    code: 'Л134-2',
                    name: 'Слаботочный щит'
                }
            ]
        },
        {
            code: 'Л135',
            name: 'Свет прихожей и котельной',
            room: 'Прихожая',
            cable: 'ВВГнг-LS 3х1.5',
            points: [
                {
                    code: 'Л135-1',
                    name: 'Коридор котельной'
                },
                {
                    code: 'Л135-2',
                    name: 'Слаботочный щит'
                }
            ]
        },
        {
            code: 'Л136',
            name: 'Выключатель у дивана',
            room: 'Кухня-гостинная',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л136-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л136-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л137',
            name: 'Датчик протечки душа',
            room: 'Санузел взрослый',
            cable: 'КПСнг-FRHF 1x2x0,75',
            points: [
                {
                    code: 'Л137-1',
                    name: 'Душ'
                },
                {
                    code: 'Л137-2',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л138',
            name: 'Датчик протечки раковины',
            room: 'Санузел взрослый',
            cable: 'КПСнг-FRHF 1x2x0,75',
            points: [
                {
                    code: 'Л138-1',
                    name: 'Раковина'
                },
                {
                    code: 'Л138-2',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л139',
            name: 'Датчик протечки ванна',
            room: 'Санузел детский',
            cable: 'КПСнг-FRHF 1x2x0,75',
            points: [
                {
                    code: 'Л139-1',
                    name: 'Ванна'
                },
                {
                    code: 'Л139-2',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л140',
            name: 'Датчик протечки раковина',
            room: 'Санузел детский',
            cable: 'КПСнг-FRHF 1x2x0,75',
            points: [
                {
                    code: 'Л140-1',
                    name: 'Раковина'
                },
                {
                    code: 'Л140-2',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л141',
            name: 'Датчик протечки стиральная машина',
            room: 'Котельная',
            cable: 'КПСнг-FRHF 1x2x0,75',
            points: [
                {
                    code: 'Л141-1',
                    name: 'Стиральная машина'
                },
                {
                    code: 'Л141-2',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л142',
            name: 'Выключатель коридора взрослого',
            room: 'Коридор взрослый',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л142-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л142-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л143',
            name: 'Выключатель (в дверном откосе) котельной',
            room: 'Котельная',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л143-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л143-2',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л144',
            name: 'Выключатель коридор котельной',
            room: 'Коридор котельной',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л144-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л144-2',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л145',
            name: 'Выключатель прихожей у межкомнатной двери',
            room: 'Прихожая',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л145-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л145-2',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л146',
            name: 'Пульт пожарной сигнализации',
            room: 'Прихожая',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л146-1',
                    name: 'Пульт'
                },
                {
                    code: 'Л146-2',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л147',
            name: 'Выключатель коридор детский',
            room: 'Коридор детский',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л147-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л147-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л148',
            name: 'Сушильный шкаф (слаботочная линия)',
            room: 'Котельная',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л148-1',
                    name: 'Сушильный шкаф'
                },
                {
                    code: 'Л148-2',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л149',
            name: 'Выключатель у двери',
            room: 'Комната Мии',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л149-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л149-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л150',
            name: 'Выключатель у зеркала',
            room: 'Санузел детский',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л150-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л150-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л151',
            name: 'Выключаетль у двери',
            room: 'Санузел детский',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л151-1',
                    name: 'Выключатель'
                },
                {
                    code: 'Л151-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л152',
            name: 'Кондиционер (слаботочная линия)',
            room: 'Комната Марка',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л152-1',
                    name: 'Кондиционер'
                },
                {
                    code: 'Л152-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л153',
            name: 'Кондиционер (слаботочная линия)',
            room: 'Комната Мии',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л153-1',
                    name: 'Кондиционер'
                },
                {
                    code: 'Л153-2',
                    name: 'Коридор детский'
                }
            ]
        },
        {
            code: 'Л154',
            name: 'Кондиционер (слаботочная линия)',
            room: 'Кухня-гостинная',
            cable: 'UTP 5E',
            points: [
                {
                    code: 'Л154-1',
                    name: 'Кондиционер'
                },
                {
                    code: 'Л154-2',
                    name: 'Коридор взрослый'
                }
            ]
        },
        {
            code: 'Л155',
            name: 'Датчик протечки кухонной мойки',
            room: 'Кухня-гостинная',
            cable: 'КПСнг-FRHF 1x2x0,75',
            points: [
                {
                    code: 'Л155-1',
                    name: 'Шкаф под мойкой'
                },
                {
                    code: 'Л155-2',
                    name: 'Коридор котельной'
                }
            ]
        },
        {
            code: 'Л156',
            name: 'Датчик протечки посудомоечной машины',
            room: 'Кухня-гостинная',
            cable: 'КПСнг-FRHF 1x2x0,75',
            points: [
                {
                    code: 'Л156-1',
                    name: 'Посудомоечная машина'
                },
                {
                    code: 'Л156-2',
                    name: 'Коридор котельной'
                }
            ]
        },
    ]
    const rooms = cableLines.reduce((acc: string[], item) => {
        if (!acc.includes(item.room)) {
            acc.push(item.room)
        }
        return acc
    }, [])
    rooms.sort()

    const cables = cableLines.reduce((acc: string[], item) => {
        if (!acc.includes(item.cable)) {
            acc.push(item.cable)
        }
        return acc
    }, [])
    cables.sort()

    let filteredCableLines = [...cableLines]

    let query = ''
    let room = ''
    let cable = ''
    function search() {
        if (query) {
            const normalizedQuery = query.toLowerCase()

            filteredCableLines = cableLines.filter((line) => {
                const inName = line.name.toLowerCase().indexOf(normalizedQuery) !== -1
                const inCable = line.cable.toLowerCase().indexOf(normalizedQuery) !== -1
                const inPoints = line.points.some((point) => {
                    const inPointCode = point.code.toLowerCase().indexOf(normalizedQuery) !== -1
                    const inPointName = point.name.toLowerCase().indexOf(normalizedQuery) !== -1

                    return inPointCode || inPointName
                })

                return inName || inCable || inPoints
            })
        } else {
            filteredCableLines = [...cableLines]
        }

        if (room) {
            filteredCableLines = filteredCableLines.filter((line) => room === line.room)
        }

        if (cable) {
            filteredCableLines = filteredCableLines.filter((line) => cable === line.cable)
        }
    }

    function isHighlight(point:any) {
        if (query) {
            return point.name.toLowerCase().includes(query.toLowerCase())
        }
    }
</script>

<div class="container">
    <div class="filter">
        <input bind:value={ query } type="text" placeholder="Поиск" on:input={ search }>
        <select bind:value={ room } on:change={search}>
            {#each rooms as room}
                <option>{ room }</option>
            {/each}
        </select>
        <select bind:value={ cable } on:change={search}>
            {#each cables as cable}
                <option>{ cable }</option>
            {/each}
        </select>
    </div>

    {#each filteredCableLines as line}
        <div class="line">
            <div class="line__name">{line.code} - { line.name } - { line.room }</div>
            <div class="line__cable">{ line.cable }</div>
            <div class="line__dots">
                {#each line.points as point}
                    <div class="line__point" class:highlight={isHighlight(point)}>
                        <span class="line__point-code">{ point.code }</span>
                        <span class="line__point-name">{ point.name }</span>
                    </div>
                {/each}
            </div>
        </div>
    {/each} 
</div>

<style>
    * {
        box-sizing: border-box;
    }

    .container {
        font-family: Arial, Helvetica, sans-serif;
        font-size: 18px;
        color: #313131;
        width: 600px;
        margin: 0 auto;
        display: flex;
        flex-direction: column;
        gap: 20px;
    }

    .filter {
        display: flex;
        flex-direction: column;
        gap: 10px;
    }

    input,
    select {
        padding: 5px 10px;
        border: 1px solid #bab8b8;
        border-radius: 5px;
        font-size: inherit;
        width: 100%;
    }

    .line {
        display: flex;
        flex-direction: column;
        gap: 5px;
    }

    .line__name {
        font-weight: 600;
    }

    .line__cable {
        color: #717171;
        font-size: 0.8em;
    }

    .line__dots {
        padding-left: 1em;
        font-size: 0.8em;
        display: flex;
        flex-direction: column;
        gap: 5px;
    }

    .highlight {
        background-color: #e7e586;
    }
</style>